{
"Domain check"                              : "Проверка домена"
,"Pre-delegated domain"                     : "Проверка неделегированного домена"
,"Domain name"                              : "Имя домена"
,"Basic"                                    : "Результат"
,"Advanced"                                 : "Подробно"
,"Export"                                   : "Экспорт"
,"History"                                  : "История"
,"Download"                                 : "Скачать"
,"Nameservers"                              : "DNS серверы"
,"Digests"                                  :"Контрольные суммы"
,"Fetch data from parent zone"              :"Взять данные из родительской зоны"
,"Advanced options"                         :"Дополнительные опции"
,"Notice! This is an undelegated test"      :"Внимание! Это тест для доменов, которые не делегированны"
,"Test #":"Тест №"
,"Executed at":"Выполнен: "
,"Link":"Ссылка"
,"About ZoneMaster": "Информация о ZoneMaster"
,"About ZoneMaster Text":"Дайте вашему домену полный физический! Zonemaster помогает вам контролировать, как работает ваш сайт. В качестве бонуса вы также получите лучшее представление о том, как работает доменная система DNS. Когда домен (также называемый зоной) отправляется в Zonemaster, программа исследует состояние домена от начала до конца. Это делается с помощью Zonemaster, изучающего DNS от корня (.) До TLD (домен верхнего уровня, например .se), а затем, наконец, через DNS-серверы, содержащие информацию о указанном домене (например, zonemaster.se ). Zonemaster также может выполнять многие другие тесты, например, проверять подписи DNSSEC, доступ к различным хостам и правильность IP-адресов. Это все, чтобы убедиться, что ваш домен работает как можно лучше."
,"About domain name system, DNS": "О системе доменных имен, DNS"
,"About DNS Text":"Большинство людей, которые пользуются Интернетом, никогда не задумывались над тем, что на самом деле происходит, когда вы набираете адрес в своем веб-браузере, а затем нажимаете кнопку ввода. Для упрощения система доменных имен (DNS) представляет собой базу данных, которая связывает имена доменов с IP-адресами, так же, как телефонная книга связывает имена с телефонными номерами. IP-адрес - это уникальная серия номеров, которая идентифицирует каждый компьютер, подключенный к Интернету. Это похоже на то, как каждый телефон имеет свой номер в телефонной сети. Длинная серия чисел отлично подходит для компьютеров, но людям трудно запоминать. Таким образом, DNS был разработан дополнительная система для нас, когда мы хотим достичь веб-сервера на определенном сайте или на сервере электронной почты, на который хотим отправить электронное письмо."
,"":""
}
