Repository: zonemaster/zonemaster-gui
Catalog: src/locale/messages.*.xlf
Languages: es, fi, sl, sv

source: It depends on which test failed for your domain name. Each test are accompanied with one or several messages describing the issues found. You can also get further insight about each test from the <a href="https://github.com/zonemaster/zonemaster/tree/master/docs/public/specifications/tests#list-of-defined-test-cases">Defined Test Cases</a> document.
sv: Det beror på vilken test det gäller. Varje testfall kommer med ett eller flera meddelanden som beskriver det problem som har funnits. Mera detaljer om varje testfall kan hittas via dokumentet "<a href="https://github.com/zonemaster/zonemaster/tree/master/docs/public/specifications/tests#list-of-defined-test-cases">Defined Test Cases</a>" (Definierade testfall).

source: About Zonemaster
es: Acerca de Zonemaster
fi: Zonemasterista
sl: O Zonemaster

source: Algorithm required
es: Algoritmo necesario
fi: Algoritmi vaaditaan
sl: Algoritem je obvezen

source: All
es: Todos
fi: Kaikki
sl: Vse

source: Digest
es: Resumen
fi: Tiiviste
sl: Izvleček

source: Digest required
es: Resumen necesario
fi: Tiiviste (Digest) vaaditaan
sl: Izvleček je obvezen

source: Digest type required
es: Tipo de resumen necesario
fi: Tiivisteen (Digest) tyyppi vaaditaan
sl: Tip izvlečka je obvezen

source: Disable IPv4
es: Deshabilitar IPv4
fi: Poista IPv4 käytöstä
sl: Onemogoči IPv4

source: Disable IPv6
es: Deshabilitar IPv6
fi: Poista IPv6 käytöstä
sl: Onemogoči IPv6

source: Domain name required
es: Nombre de dominio necesario
fi: Verkkotunnus vaaditaan
sl: Domena je obvezna

source: Export
es: Exportar
fi: Vie
sl: Izvozi

source: Fetch NS from parent zone
es: Obtener datos desde la zona padre
fi: Hae NS-tietueet pääverkkotunnuksesta
sl: Pridobi NS od nadrejene cone

source: Filter text
es: Filtrar texto
fi: Suodata tekstit
sl: Filtriraj

source: Keytag
es: Tag de Llave

source: Keytag required
es: Tag de llave necesaria
fi: Keytag vaaditaan
sl: Keytag je obvezen

source: Notice! More info on undelegated test
es: ¡Aviso! Más información en la prueba no-delegada
fi: Huomaa! Lisätietoja delegoimattoman verkkotunnuksen testistä
sl: Več podatkov o nedelegiranem testu

source: Options
es: Opciones
fi: Valinnat
sl: Možnosti

source: Reset
es: Restablecer
fi: Tyhjennä valinnat
sl: Ponastavi

source: Run test
es: Ejecutar la prueba
fi: Suorita testi
sl: Zaženi test

source: Display all results.
es: Mostrar todos los resultados.
fi: Näytä kaikki tulokset.
sl: Prikaži vse rezultate.

source: Critical - means a very serious error.
es: Crítico - significa un error muy serio.
fi: Critical - vakava virhe, joka voi estää verkkotunnuksen toiminnan.
sl: Kritično – zelo resna napaka.

source: Error - means a problem that is very likely (or possibly certain) to negatively affect the function of the zone being tested, but not so severe that the entire zone becomes unresolvable.
es: Error - significa un problema que es muy probable (con cierta certeza) que afecte negativamente el funcionamiento de la zona en prueba, pero no tan severo como para que toda la zona quede sin resolución.
fi: Error - virhe joka ei kuitenkaan vaikuta verkkotunnuksen toimintaan merkittävästi. Virheet kannattaa käydä läpi.
sl: Napaka – težava, ki bo najverjetneje negativno vplivala na delovanje testirane cone, toda ni tako resna, da bi povzročila izpad.

source: Info - is something that may be of interest to the zone's administrator but that definitely does not indicate a problem.
es: Info - es algo que puede ser de interés para el administrador de la zona, pero que definitivamente no indica un problema.
fi: Info - Sisältää tietoa joka saattaa kiinnostaa, nämä eivät ole virheitä.

source: Notice - means something that should be known by the zone's administrator but that need not necessarily be a problem at all.
es: Aviso - significa algo que debería ser conocido por el administrador de la zona, pero que no necesariamente indica un problema.
fi: Notice - Tarkoitettu verkkotunnuksen nimipalveluista vastaavalle, ei ole välttämättä ongelma ollenkaan.

source: Warning - means something that will under some circumstances be a problem, but that is unlikely to be noticed by a casual user.
es: Advertencia - significa algo que podría ser un problema bajo ciertas circunstancias, pero que es poco probable que sea advertido por un usuario casual.
fi: Warning - Tarkoittaa jotain joka voi joissain olosuhteissa olla ongelma, mutta todennäköisesti ei koske millään tavoin tavallista käyttäjää.
sl: Opozorilo – nekaj, kar bi pod določenimi pogoji lahko povzročilo težave.

source: Copyright © AFNIC and The Swedish Internet Foundation. All Rights Reserved
es: Copyright © AFNIC y The Swedish Internet Foundation. Todos los Derechos Reservados
sl: Copyright © AFNIC in The Swedish Internet Foundation. Vse pravice pridržane

source: Delegated
es: Delegados
fi: Delegoitu
sl: Delegirano

source: Undelegated
es: No están delegados
fi: Delegointi puuttuu
sl: Nedelegirano

source: Undelegated
es: No está delegado
fi: Delegointi puuttuu
sl: Nedelegirana

source: Info
es: Información

source: Give your domain name a complete checkup! Zonemaster helps you assess how your domain name is doing. Besides, you can also get a better understanding of how the DNS (Domain Name System) works. When a domain name is sent to Zonemaster for testing, the program investigates the state of the domain name (sometimes called 'zone') from top to bottom of the DNS tree. Specifically, this is usually done by examining DNS data from the root ('.') to the TLD (Top-Level Domain; e.g., '.net') for that domain name, and then finally through the DNS servers that contain authoritative information about the specified domain name (e.g., 'zonemaster.net'). Zonemaster performs many tests, such as checking DNSSEC signatures, or that different hosts can be accessed and that IP addresses are valid. This is all to make sure that your domain name runs as smoothly as possible.
es: ¡Dele a su dominio una revisión completa! Zonemaster le ayuda a evaluar cómo lo está haciendo su nombre de dominio. Además, podrás entender mejor cómo funciona el sistema de nombres de dominio, el DNS. Cuando un nombre de dominio es enviado a Zonemaster para su revisión, el programa investiga el estado del nombre de dominio (a veces llamado 'zona') de arriba a abajo en el árbol DNS. Específicamente, se examina los datos DNS desde la raíz (.), pasando por el TLD (dominio de primer-nivel, por ejemplo, .net), para llegar finalmente a los servidores DNS que tienen la información específica del nombre de dominio (por ejemplo, zonemaster.net). Zonemaster realiza muchas pruebas, por ejemplo revisar las firmas DNSSEC, o que los distintos servidores sean alcanzables, y que todas las direcciones IP sean válidas. Todo esto para asegurar que su nombre de dominio funcione tan bien como sea posible.
fi: Tee verkkotunnuksellesi täydellinen tarkistus! Zonemaster auttaa sinua arvioimaan, kuinka verkkotunnuksesi toimii. Lisäksi voit myös saada paremman käsityksen siitä, kuinka Nimipalvelu (DNS, Domain Name System) toimii. Kun verkkotunnus testataan Zonemasterissa, ohjelma tutkii verkkotunnuksen (joskus kutsutaan nimellä "alue") DNS-puun ylhäältä alas. Tämä tehdään yleensä tarkastelemalla DNS-tietoja alkaen juurivyöhykkeestä ('.') kyseisen verkkotunnuksen TLD:n kautta (Top-Level Domain; esim. '.fi') aina verkkotunnuksen (esim. 'zonemaster.fi') määrittelyt sisältäviin autoritäärisiin nimipalvelimiin asti Zonemaster suorittaa suuren määrän testejä, kuten testaa DNSSEC allekirjoituksia, testaa että eri hosteja voidaan käyttää tai testaa sen että IP-osoitteet ovat kelvollisia. Tämä kaikki varmistaa, että verkkotunnuksesi toimii mahdollisimman sujuvasti.

source: About the DNS
es: Acerca del DNS
fi: Tietoja DNS:stä
sl: O DNS

source: Most people who use the Internet have never reflected on what actually happens when one types an address in their web browser and then clicks the 'Enter' button. In short, the DNS (Domain Name System) is a database that associates domain names to IP (Internet Protocol) addresses, the same way a phone book associates names to phone numbers. An IP address is a unique series of numbers that identifies every computer that is connected to the Internet. It is similar to the way every telephone has its own number in the telephone network. Such long series of numbers work fine for computers, but for people it is way more difficult to memorize. Thus, the DNS has been developed as an extra layer to map between names that we can remember better and IP addresses used by computers whenever we want to reach a specific website or use other services on the Internet (e.g., mail).
es: La mayoría de las personas que usan Internet nunca se preguntan qué sucede realmente cuando uno escribe una dirección en su navegador web y presiona el botón 'Intro'. Simplificadamente, el Sistema de Nombres de Dominio (DNS), es una base de datos que asocia nombres de dominio a direcciones IP (Protocolo Internet), de la misma forma que una libreta de teléfonos asocia nombres a números de teléfono. Una dirección IP es una serie de números únicos que identifica a todos los computadores que están conectados a Internet. Es similar a la forma en que cada teléfono tiene su número propio en la red telefónica. Una serie larga de números funciona bien para computadores, pero es difícil de memorizar para las personas. Por lo tanto, se desarrolló el DNS como una capa extra que mapea entre nombres que podemos recordar mejor, y direcciones IP que son usadas por computadores, para cualquier momento que queramos llegar a un servidor web en específico, o usar otros servicios en Internet (por ej., email).
fi: Useimmat Internetiä käyttävät ihmiset eivät ole koskaan miettineet, mitä tapahtuu, kun joku kirjoittaa osoitteen verkkoselaimeensa ja sitten napsauttaa Enter-painiketta. Lyhyesti sanottuna DNS (Domain Name System) on tietokanta, joka yhdistää verkkotunnukset IP-osoitteisiin (Internet Protocol) samalla tavalla kuin puhelinluettelo liittää nimet puhelinnumeroihin. IP-osoite on ainutlaatuinen numerosarja, joka yksilöi jokaisen Internetiin yhdistetyn tietokoneen. Sitä voi verrata vaikka siihen että jokaisella puhelimella on oma numeronsa puhelinverkossa. Tällaiset pitkät numerosarjat toimivat hyvin tietokoneissa, mutta ihmisille ne ovat paljon vaikeampia muistaa. Siksi DNS on kehitetty lisä kerrokseksi yhdistämään muistamamme nimet ja tietokoneiden käyttämät IP-osoitteet aina, kun haluamme päästä tietylle verkkosivustolle tai haluamme käyttää muita Internetin palveluita (esim. sähköpostia).

source: Run domain test
es: Ejecutar prueba de dominio
fi: Suorita verkkotunnus testi
sl: Testiraj domeno

source: Run
es: Ejecutar
fi: Suorita
sl: Zaženi

source: Nameserver
es: Servidor de nombre
fi: Nimipalvelin
sl: Imenski strežnik

source: Nameserver required
es: Servidor de nombre necesario
fi: Nimipalvelin vaaditaan
sl: Imenski strežnik je obvezen

source: IP address
es: Dirección IP
fi: IP-osoite
sl: Naslov IP

source: Delete nameserver
es: Borrar servidor de nombre
fi: Poista nimipalvelin
sl: Zbriši imenski strežnik

source: Add new nameserver
es: Agregar nuevo servidor de nombre
fi: Lisää uusi nimipalvelin
sl: Dodaj imenski strežnik

source: Delete DS record
es: Eliminar registro DS
fi: Poista DS-tietue
sl: Zbriši DS zapis

source: Add new DS record
es: Agregar nuevo registro DS
fi: Lisää uusi DS-tietue
sl: Dodaj DS zapis

source: Cannot disable both IPv4 and IPv6
es: No puede deshabilitar ambos IPv4 e IPv6
fi: Ei pysty poistamaan käytöstä molempia, sekä IPv4 että IPv6
sl: Ni možno onemogočiti IPv4 in IPv6

source: Filter results
es: Filtrar resultados
fi: Suodata tulokset
sl: Filtriraj rezultat

# ngb.progressbar.value
source: /** * The
es: rogress bar.

source: Source code
es: Código fuente
fi: Lähdekoodi
sl: Izvorna koda

source: Documentation
es: Documentación
fi: Dokumentaatio
sl: Dokumentacija

# zm.faq.title
source: FAQ
fi: Usein kysytyt kysymykset (FAQ)

source: Info - is something that may be of interest to the zone's administrator but that definitely does not indicate a problem.
sl: Info – podatek, ki bi lahko bil zanimiv za administratorja cone, zagotovo pa ne nakazuje nobene težave.

source: Notice - means something that should be known by the zone's administrator but that need not necessarily be a problem at all.
sl: Obvestilo - podatek, s katerim bi moral administrator cone biti seznanjen, ne nakazuje pa nobene težave.

source: Give your domain name a complete checkup! Zonemaster helps you assess how your domain name is doing. Besides, you can also get a better understanding of how the DNS (Domain Name System) works. When a domain name is sent to Zonemaster for testing, the program investigates the state of the domain name (sometimes called 'zone') from top to bottom of the DNS tree. Specifically, this is usually done by examining DNS data from the root ('.') to the TLD (Top-Level Domain; e.g., '.net') for that domain name, and then finally through the DNS servers that contain authoritative information about the specified domain name (e.g., 'zonemaster.net'). Zonemaster performs many tests, such as checking DNSSEC signatures, or that different hosts can be accessed and that IP addresses are valid. This is all to make sure that your domain name runs as smoothly as possible.
sl: Opravite popoln pregled domene! Zonemaster vam pomaga oceniti stanje vaše domene. Poleg tega se lahko naučite več o delovanju sistema DNS (Domain Name System). Ko se domena pošlje v testiranje programu Zonemaster, program preveri stanje domene od vrha do dna drevesa DNS. Običajno se to opravi tako, da se podatki DNS pregledajo od korena ("."), prek vrhnje domene (npr. ".si") te domene do imenskih strežnikov, ki vsebujejo avtoritativne informacije za določeno domeno (npr. "register.si"). Program Zonemaster opravi veliko testov, kot so npr. preverjanje podpisov DNSSEC ali preverjanje dostopnosti različnih strežnikov in veljavnosti naslovov IP. Vse to zagotavlja, da vaša domena deluje kar se da najbolje.

source: Most people who use the Internet have never reflected on what actually happens when one types an address in their web browser and then clicks the 'Enter' button. In short, the DNS (Domain Name System) is a database that associates domain names to IP (Internet Protocol) addresses, the same way a phone book associates names to phone numbers. An IP address is a unique series of numbers that identifies every computer that is connected to the Internet. It is similar to the way every telephone has its own number in the telephone network. Such long series of numbers work fine for computers, but for people it is way more difficult to memorize. Thus, the DNS has been developed as an extra layer to map between names that we can remember better and IP addresses used by computers whenever we want to reach a specific website or use other services on the Internet (e.g., mail).
sl: Večina ljudi se nikoli ne vpraša, kaj se dejansko zgodi, ko v spletni brskalnik vnesemo naslov spletne strani. Na kratko, sistem DNS (Domain Name System) je podatkovna zbirka, ki povezuje domene z naslovi IP (Internet Protocol), podobno kot telefonski imenik povezuje imena s telefonskimi številkami. Naslov IP je edinstven identifikator, ki identificira vsak računalnik priključen na internet. Ti zapleteni številčni identifikatorji so popolnoma primerni za računalnike, vendar si jih ljudje veliko težje zapomnimo. Zato je bil razvit sistem DNS, da vzpostavi povezavo med domenami, ki si jih lažje zapomnimo, in naslovi IP, ki jih uporabljajo računalniki, ko želimo dostopati do spletnega mesta ali uporabljati druge storitve (npr. elektronsko pošto)..
