Repository: zonemaster/zonemaster-gui
Catalog: src/locale/messages.*.xlf
Languages: es, fi, sl, sv

source: Algorithm
es: Algoritmo
fi: Algoritmi
sl: Algoritem
sv: Algoritm

source: Digest type
es: Tipo de resumen
fi: Tiivisteen (Digest) tyyppi
sl: Tip izvlečka
sv: Digest-typ

source: Error during parent data fetching.
es: Error durante la obtención de datos del padre.
fi: Virhe haettaessa tietoja pääverkkotunnuksesta.
sl: Napaka med pridobivanjem podatkov.
sv: Fel när data skulle hämtas från moderzonen.

source: History
es: Historia
fi: Historia
sl: Zgodovina
sv: Tidigare test

source: History information request is in progress.
es: Solicitud de información histórica en progreso.
fi: Aiempien testitulosten haku käynnissä.
sl: Pridobivanje zgodovine v teku.
sv: Begäran om att hämta tidigare testdata pågår.

source: Nameservers
es: Servidores de nombres
fi: Nimipalvelimet
sl: Imenski strežniki
sv: Namnservrar

source: No data for this test.
es: No hay datos para esta prueba.
fi: Ei dataa tätä testiä varten.
sl: Ni podatkov za ta test.
sv: Data saknas för detta test.

source: Page Not Found
es: Página No Encontrada
fi: Sivua ei löytynyt
sl: Stran ne obstaja
sv: Sidan hittades inte

source: Parent data fetched with success.
es: Los datos del padre fueron obtenidos exitosamente.
fi: Data haettiin pääverkkotunnuksesta ongelmitta.
sl: Podatki uspešno pridobljeni.
sv: Data hämtades från moderzonen utan problem.

source: Please set the api endpoint
es: Por favor defina el punto de destino ("endpoint") de la api
fi: Aseta API endpoint
sl: Prosimo nastavite API endpoint
sv: Vänligen ställ in 'api endpoint'

source: Profile
es: Perfil
fi: Profiili
sl: Profil
sv: Profil

source: Program versions
es: Versiones del programa
fi: Ohjelman versiot
sl: Verzija programa
sv: Programversioner

source: Results from previous tests are not available.
es: No están disponibles los resultados de pruebas anteriores.
fi: Ei aiempia testituloksia.
sl: Rezultati prejšnjega testa niso na voljo.
sv: Det finns inga resultat från tidigare test.

source: Share
es: Compartir
fi: Jaa
sl: Deli
sv: Dela

source: Sorry, there is nothing here!
es: Lo siento, ¡no hay nada aquí!
fi: Ikävä kyllä täällä ei ole mitään!
sl: Pardon, tukaj ni nič !
sv: Tyvärr, det finns ingenting här!

source: What is an undelegated domain test?
es: ¿Qué es una prueba de dominio no delegado?
fi: Mikä on delegoimattoman verkkotunnuksen testi?
sl: Kaj je test nedelegirane domene?
sv: Vad är ett odelegerat domäntest?

source: Zonemaster Backend is not available.
es: El servidor interno de Zonemaster no está disponible.
fi: Zonemaster Backend ei ole käytettävissä.
sl: Zonemaster Backend ni na razpolago.
sv: Zonemaster-Backend är inte åtkomlig.

source: Click to return on the top page
es: Cliquee para volver al comienzo de la página
fi: Valitse palataksesi yläsivulle
sl: Na vrh strani
sv: Klicka för att komma tillbaka till överst på sidan

source: Error 404
fi: Virhe 404
sl: Napaka 404
sv: HTTP-fel 404

source: Result
es: Resultado
fi: Tulos
sl: Rezultat
sv: Resultat

source: Close
es: Cerrar
fi: Sulje
sl: Zapri
sv: Stäng

source: All
es: Todos
fi: Kaikki
sl: Vse
sv: Alla

source: Notice
es: Aviso
fi: Ilmoitus
sl: Obvestilo
sv: Notering

source: Warning
es: Advertencia
fi: Varoitus
sl: Opozorilo
sv: Varning

source: Error
fi: Virhe
sl: Napaka
sv: Fel

source: Critical
es: Crítico
fi: Kriittinen
sl: Kritično
sv: Allvarligt

source: Module
es: Módulo
fi: Moduuli
sl: Modul
sv: Modul

source: Level
es: Nivel
fi: Taso
sl: Stopnja
sv: Nivå

source: Message
es: Mensaje
fi: Viesti
sl: Sporočilo
sv: Meddelande

source: Change language
es: Cambiar idioma
fi: Vaihda kieli
sl: Spremeni jezik
sv: Byt språk

source: Test completed!
es: ¡Prueba completa!
fi: Testi on valmis!
sl: Test končan!
sv: Testet är färdigt!

source: Clear domain input
es: Limpiar entrada de dominio
fi: Tyhjennä sisältö
sl: Počisti vnos
sv: Rensa domännamnsfältet

source: DS records
es: Registros DS
fi: DS tietue
sl: DS zapisi
sv: DS-post

source: General
fi: Yleinen
sl: Splošno
sv: Generell

source: Protocol
es: Protocolo
fi: Protokolla
sl: Protokol
sv: Standard

source: No data found for the zone.
es: No se encontraron datos para la zona.
fi: Vyöhykkeelle (zone) ei löytynyt dataa.
sl: Ni podatkov.
sv: Det finns ingen data för zonen.

source: Link to test
es: Enlace a la prueba
fi: Linkki testiin
sl: Povezava do testa
sv: Länk till test

source: Copy link to clipboard
es: Copiar enlace al portapapeles
fi: Kopioi linkki työpöydälle
sl: Kopiraj povezavo
sv: Kopiera länk till klippbuffert

source: Fetch DS from parent zone
es: Obtener DS desde la zona padre
fi: Nouda DS-tietueet ylemmältä tasolta
sl: Pridobi DS iz nadrejene cone
sv: Hämta DS-poster från moderzon

source: No previous tests found for this domain.
es: No se encontraron pruebas anteriores para este dominio.
fi: Tälle verkkotunnukselle ei löytynyt vanhempia testejä.
sl: Ni prejšnjih testov za to domeno.
sv: Det fanns inga tidigare test för detta domännamn.

source: An unexpected server error happened.
es: Ha ocurrido un error inesperado en el servidor.
fi: Tapahtui odottamaton palvelinvirhe.
sl: Nepričakovana napaka na strežniku.
sv: Ett oväntat fel inträffade i servern.

# ngb.pagination.first-aria
source: First
es: Primera
fi: Ensimmäinen
sl: Začetek
sv: Första

# ngb.pagination.previous-aria
source: Previous
es: Anterior
fi: Edellinen
sl: Nazaj
sv: Föregående

# ngb.pagination.next-aria
source: Next
es: Siguiente
fi: Seuraava
sl: Naprej
sv: Nästa

# ngb.pagination.last-aria
source: Last
es: Última
fi: Viimeinen
sl: Konec
sv: Sista

source: Domain name
es: Nombre de dominio
fi: Verkkotunnus
sl: Domena
sv: Domännamn

source: More information on undelegated test:
sv: Mer information om odelegerat test:

source: Give your domain name a complete checkup! <strong>Zonemaster helps you assess how your domain name is doing.</strong>
sv: Ge ditt domännamn en fullständig kontroll! <strong>Zonemaster hjälper dig att bedöma hur ditt domännamn fungerar.</strong>

source: <strong>Zonemaster performs many tests</strong>, such as checking DNSSEC signatures, or that different hosts can be accessed and that IP addresses are valid. This is all to make sure that your domain name runs as smoothly as possible.
sv: <strong>Zonemaster utför många test</strong>, som att kontrollera kryptografiska signaturer för det som kallas DNSSEC, att de olika servrarna är åtkomliga och att IP-adresserna är giltiga. Allt detta görs för att säkerställa att ditt domännamn fungerar så problemfritt som möjligt.

source: Frequently asked questions
sv: Vanliga frågor

source: What is Zonemaster?
sv: Vad är Zonemaster?

source: Who is behind Zonemaster?
sv: Vem står bakom Zonemaster?

source: Zonemaster is a joint project between <a i18n-href="Afnic link" href="https://www.afnic.fr/en/">AFNIC</a> (registry of '.fr' TLD and several other TLDs, e.g. '.re', '.pm', '.tf', '.wf', '.yt' and '.paris') and <a i18n-href="IIS link" href="https://internetstiftelsen.se/en/">The Swedish Internet Foundation</a> (registry of '.se' and '.nu' TLDs).
sv: Zonemaster är ett samarbetsprojekt mellan <a i18n-href="IIS link" href="https://internetstiftelsen.se/en/">Internetstiftelsen</a> (registry för .se och .nu) och <a i18n-href="Afnic link" href="https://www.afnic.fr/en/">AFNIC</a> (registry för .fr och andra TLD:er som .re, .pm, .tf, .wf, .yt och .paris).

source: How can Zonemaster help me?
sv: Hur kan Zonemaster hjälpa till?

source: The Zonemaster tool could help different kind of users:
sv: Zonemaster är framtaget för två kategorier av användare:

source: Users who just want to know whether the domain name they own or use have any issues or not.
sv: Användare som bara vill veta om domäner som hen äger eller använder har några problem eller inte.

source: Users of the second category should contact their DNS operator in case there are errors or warnings for any test of their domain name.
sv: Användare av den andra kategorin bör vända sig till sin DNS-operatör ifall det finns fel eller varningar när deras domännamn testats.

source: What makes Zonemaster different from other DNS zone validating software?
sv: Vad skiljer Zonemaster från andra program som testar domäner?

source: Firstly, Zonemaster saves all history from earlier tests based on the tested domain name, which means you can go back to a test you did some time ago and compare it to the test you ran just a moment ago.
sv: För det första så sparar Zonemaster all testhistorik utifrån den testade domänen, vilket innebär att man kan gå tillbaka till ett tidigare test och jämföra med ett test som just har körts.

source: Lastly, this open source version of Zonemaster was built using modular code which basically means that you can integrate parts of it in your own systems, if you wish. For example, it is quite rare that you would want a complete program just to check for redelegations.
sv: Och till sist, Zonemaster är öppen källkod och är modulärt uppbyggt, vilket betyder att man kan integrera delar av Zonemaster i sitt eget system om man vill.

source: How can Zonemaster distinguish between what is right and wrong?
sv: Hur kan Zonemaster bedömma vad som är rätt och fel?

source: Sometimes there are different interpretations of the standards or opinions on what is best practice, and the Zonemaster team is always open to input. If you think we have made a mistake in our judgement please do not hesitate to send us an email at <a href="mailto:zonemaster-users@lists.iis.se">zonemaster-users@lists.iis.se</a> (moderated mailing list) with a link to your test result and an explanation as to why you think it shows something that you consider incorrect.
sv: Ibland finns det olika tolkningar av standarden eller synpunkter på vad som är den rekommenderade inställningen. Zonemastergruppen välkomnar alltid synpunkter och kommentarer på detta. Om du tror du hittat något som du tycker att vi har felbedömt, tveka inte att kontakta oss på <a href="mailto:zonemaster-users@lists.iis.se">zonemaster-users@lists.iis.se</a> (modererad e-postlista) med en länk till ditt test och en förklaring av varför du anser att resultatet inte är korrekt.

source: What kind of queries does Zonemaster generate?
sv: Vilken typ av DNS-frågor ställer Zonemaster?

source: Zonemaster send multiple DNS queries to the name servers hosting the domain name being tested and also to the name servers hosting the parent zone of that domain name.
sv: Zonemaster skickar flera DNS-frågor till namnservrarna som är hostingservrar för domänen som testas, men även till namnservrarna som är hostingservrar för den överliggande zonen till domänen som testas.

source: Zonemaster and privacy
sv: Zonemaster och integritet

source: How come my domain name cannot be tested?
sv: Varför kan jag inte testa min domän?

source: There are several possibilities:
sv: Det kan finnas flera olika anledningar till detta:

source: Your domain name is not yet delegated.
sv: Domännamnet är ännu inte delegerat.

source: Your domain name is not reachable from public Internet.
sv: Domännamnet är inte nåbart från det publika Internet.

source: Zonemaster can only test what is called a DNS zone (e.g. 'zonemaster.net') and not host names (e.g. 'www.zonemaster.net')
sv: Zonemaster kan bara testa det som kallas DNS-zoner (t.ex. "zonemaster.net") och inte enskilda datornamn (t.ex. "www.zonemaster.net").

source: There is a 10 minutes protection between consecutive tests for a given domain name (with same test parameters). Running a test within that window will instead show the last available test for that domain name (and parameters).
sv: Det finns ett skydd mot att starta upprepade test på samma domännamn (och med samma testparametrar) oftare än var tionde minut. Om man försöker att starta ett test innan perioden har löpt ut så får man resultatet från föregående test för samma domännamn (och testparametrar).

source: You have misspelled your domain name.
sv: Domännamnet har stavats fel.

source: Zonemaster returns "Error" or "Warning" for my domain name. What does it mean?
sv: Zonemaster visar "Fel" eller "Varning" när jag testar min domän, vad betyder det?

source: What is an undelegated domain test?
sv: Vad är ett odelegerat domäntest?

source: An undelegated domain test is a test performed on a domain name that may, or may not, be fully published in the DNS. This can be quite useful if one is going to migrate one's domain from one registrar to another, e.g., migrate zone 'example.com' from the name server 'ns.example.com' to the name server 'ns.example.org'. In this scenario one could perform an undelegated domain test providing the zone ('example.com') and the name server you are migrating to ('ns.example.org') before you migrate your domain. When the results of the test doesn't show any errors or warnings one can be fairly certain that the domain's new location is working well. However there might still be other problems in the zone data itself that this test is unaware of.
sv: Ett odelegerat domäntest är ett test som genomförs på en domän som inte nödvändigtvis är publicerad i DNS. Detta kan vara mycket användbart om man tänker flytta sin domän från en registrar till en annan, t.ex. flytta "example.se" från namnservern "ns1.example.com" till namnserver "dns2.example.net". I detta fall skulle du kunna köra ett odelegerat domäntest på domänen ("example.se") med den namnservern du ska flytta till ("dns2.example.net") innan du genomför själva flytten. När resultatet på testet inte visare några fel ("error") eller varningar ("warning") så kan man vara rätt säker på att domännamnets nya plats fungerar väl. Det kan emellertid fortfarande finnas fel i zoninformationen som dessa test inte känner till.

source: Does Zonemaster support IPv6?
sv: Kan Zonemaster hantera IPv6?

source: Yes. By default Zonemaster will query name servers both over IPv4 and IPv6, unless explicitly configured otherwise. Such configuration is accessible through the "Options" button.
sv: Ja. Zonemaster kommer att skicka DNS frågor till namnservrarna över både IPv4 och IPv6 om inte Zonemaster har konfigurerats på annat sätt. Under knappen "alternativ" så går det att ställa in detta.

source: Does Zonemaster verify DNSSEC?
sv: Kan Zonemaster kontrollera DNSSEC?

source: Yes. If DNSSEC is available for a domain name that is tested by Zonemaster, it will be checked automatically.
sv: Ja. Om en domän som testas av Zonemaster har DNSSEC konfigurerat så kommer det testas automatiskt.

source: Can I test the DS records before they are published?
sv: Går det att testa DS-poster innan de publiceras?

source: Yes. Use the "Options" button and there add the Delegation Signer (DS) records to be tested. Zonemaster will then use those in the same way as if they were already added in the parent zone.
sv: Ja. Använd knappen "alternativ" och lägg sedan till DS-posterna ("Delegation Signer") som ska testas. Zonemaster kommer att använda dessa på samma sätt som om de redan fanns i moderzonen.

source: How can I test a "reverse" zone with Zonemaster?
sv: Hur kan jag testa en "baklängeszon" med Zonemaster?

source: To check a reverse zone with Zonemaster, one first needs to know what the reverse zone is, and enter it in the format it has in the DNS. A reserve zone is obtained by reversing an IP address and adding a suffix. IPv4 addresses use the suffix "in-addr.arpa" while IPv6 addresses use "ip6.arpa".
sv: För att kunna kontrolla en "baklängeszon" (också kallad "reverszon" så måste man veta vilken zon det är och testa det format det har i DNS. En baklängeszon får man genom att vända IP-adressen och lägga på ett suffix. För IPv4-adresser används suffixet "in-addr.arpa" medans för IPv6-adresser används "ip6.arpa".

source: Examples:
sv: Exempel:

source: For IPv4 prefix '198.51.100.0/24': 100.51.198.in-addr.arpa
sv: För IPv4-prefix "198.51.100.0/24": 100.51.198.in-addr.arpa

source: For IPv6 prefix '2001:db8::/32': 8.b.d.0.1.0.0.2.ip6.arpa
sv: För IPv6-prefix "2001:db8::/32": 8.b.d.0.1.0.0.2.ip6.arpa

source: Source code
sv: Programkod

source: Documentation
sv: Dokumentation

source: https://internetstiftelsen.se/en/
sv: https://internetstiftelsen.se

source: https://en.wikipedia.org/wiki/Request_for_Comments
sv: https://sv.wikipedia.org/wiki/Request_for_Comments

source: The descriptions of message levels such as <i>notice</i>, <i>warning</i> and <i>error</i> are found in <a href="https://github.com/zonemaster/zonemaster/blob/master/docs/public/specifications/tests/SeverityLevelDefinitions.md">Severity Level Definitions</a>.
sv: En beskrivning av felnivåerna som används, som <i>notice</i> ("notering"), <i>warning</i> ("varning") och <i>error</i> ("fel") finns i dokumentet "<a href="https://github.com/zonemaster/zonemaster/blob/master/docs/public/specifications/tests/SeverityLevelDefinitions.md">Severity Level Definitions</a>" (Defintion av felnivåer).

source: Zonemaster is a program designed to help people check, measure and hopefully also understand how the DNS (Domain Name System) works.
sv: Zonemaster är ett program som är framtaget för att hjälpa användare att kontrollera, mäta och förhoppningsvis också bättre förstå hur DNS, "Domain Name System", fungerar.

source: It consists of several components:
sv: Den består av flera delar:

source: Engine - a test framework that supports all functionality to perform DNS tests.
sv: Engine - ett testramverk med stöd för att utföra DNS-test.

source: CLI - a command-line interface to the Engine.
sv: CLI - ett kommandoradsgränssnitt till "Engine".

source: Bakend - a server that allows you to run Zonemaster tests and save results using a JSON-RPC API and a database.
sv: Backend - en tjänst som låter dig köra zonmastertest och spara resultat med hjälp av ett JSON-RPC-API och en databas.

source: GUI - a web interface to the Backend.
sv: GUI - ett Webbgränssnitt mot "backend".

source: When a domain name (such as 'zonemaster.net') is submitted to Zonemaster (using CLI or GUI), it will verify the domain name’s general health with a series of tests. The tests conducted by Zonemaster can be found in <a href="https://github.com/zonemaster/zonemaster/tree/master/docs/public/specifications/tests#list-of-defined-test-cases">the Defined Test Cases</a> document.
sv: När Zonemaster startar en test av ett domännamn, som "zonemaster.net" (genom "CLI" eller "GUI") så kommer det att kontrollera domännamnets allmänna tillstånd med hjälp av en serie av test. Testen som utförs av Zonemaster finns listade i dokumentet "<a href="https://github.com/zonemaster/zonemaster/tree/master/docs/public/specifications/tests#list-of-defined-test-cases">Defined Test Cases</a>" (Definierade testfall).

source: Users who are knowledgable about the DNS protocol.
sv: Användare med kunskap om DNS-standarden.

source: Secondly, all tests that Zonemaster runs are defined in Test Case specifications that can be found in the <a href="https://github.com/zonemaster/zonemaster/tree/master/docs/public/specifications/tests#list-of-defined-test-cases">Defined Test Cases</a> document.
sv: För det andra så är alla test som Zonemaster kör specificerade i "<a href="https://github.com/zonemaster/zonemaster/tree/master/docs/public/specifications/tests#list-of-defined-test-cases">Test Case Specifications</a>" (testfallsspecifikationer).

source: Thirdly, Zonemaster can be used to test undelegated domain names. See <a href="faq#what-is-an-undelegated-domain-test">Question 12</a>.
sv: För det tredje så kan Zonemaster också testa icke-publicerade eller odelegerade domäner (se <a href="faq#what-is-an-undelegated-domain-test">fråga 12</a>).

source: Fourthly, Zonemaster can be used to test DS records before their publication in the parent zone (which is required to enable DNSSEC for a signed zone). See <a href="faq#can-i-test-the-ds-records-before-they-are-published">Question 13</a>.
sv: För det fjärde så kan Zonemaster användas för att testa DS-posterna innan de läggs in i moderzonen, vilket är nödvändigt för att aktivera DNSSEC för en signerad zon (se <a href="faq#can-i-test-the-ds-records-before-they-are-published">fråga 13</a>).

source: The judgement of Zonemaster is primarily based on the DNS standards as defined in <a i18n-href="RFC Wikipedia link" href="https://en.wikipedia.org/wiki/Request_for_Comments">RFCs</a>. It also bases its judgement on DNS best practices, which can be more loosely defined. All Zonemaster tests are defined in <a href="https://github.com/zonemaster/zonemaster/tree/master/docs/public/specifications/tests#list-of-defined-test-cases">Test Case Specifications</a> in which the references to the standard documents for that test case are found.
sv: Zonemasters bedömning är i första hand baserat på DNS-standarden som den är definierad i <a i18n-href="RFC Wikipedia link" href="https://en.wikipedia.org/wiki/Request_for_Comments">RFC:er</a>. Zonemaster baserar också sin bedömning på rekommenderade inställningar av DNS, vilka är mera löst definierade. Alla zonemastertest är definierade och finns som "<a href="https://github.com/zonemaster/zonemaster/tree/master/docs/public/specifications/tests#list-of-defined-test-cases">Test Case Specifications</a>" (testfallsspecifikationer) i vilka det återfinns referenser till dokument med relevant del av DNS-standarden.

source: The GUI interface of Zonemaster does not show any queries sent, only the CLI interface can. If you want to see such queries, you will have to locally install a minimally working Zonemaster instance with both the Engine and CLI components (a Docker image is also available). Queries sent can be shown using the 'DEBUG' level option. Fair warning, the output from the CLI can be quite heavy. For more information see <a href="https://github.com/zonemaster/zonemaster/blob/master/docs/public/using/cli.md">Using The CLI</a>.
sv: Webbgränssnittet till Zonemaster visar inte vilka DNS-frågon som skickar. Det är endast CLI-gränssnittet som kan visa det. Om man vill se DNS-frågorna så måste man göra en lokal installation av både Zonemaster-Engine och Zonemaster-CLI, alternativt installera den Docker-image som också finns tillgänglig. DNS-frågorna kan visas genom att välja DEBUG-nivån "--level DEBUG". Det ska poängteras att det blir mycket som visas från CLI-gränssnittet i det fallet. För mera information se "<a href="https://github.com/zonemaster/zonemaster/blob/master/docs/public/using/cli.md">Using The CLI</a>" (användardokumentet för CLI).

source: Since <a href="https://zonemaster.net/">Zonemaster.net</a> is open to everyone it is possible for anyone to check your domain and its history of tests. However there is no way to tell who has run a specific test since nothing more than the test parameters and results are stored. Specifically, no cookies or information on the user's IP address is stored in the database. The user who initiated the test cannot be traced back from the information in the database.
sv: Eftersom <a href="https://zonemaster.net/">Zonemaster.net</a> är tillgänglig för vem som helst, så kan vem som helst kontrollera din domän och se dess testhistorik. Å andra sidan så finns det inget sett att ta reda på vem som har kört ett test eftersom det bara är testparametrar och testresultat som sparas. Specifikt så sparas inga cookies eller annan information om användarens IP-adress i databasen. Användaren som initierade testet kan inte spåras från informationen i databasen.
